/* Portion of pagelet title */
"Archive" = "Archive";

/* String_On_Page_Template */
"You need to turn on archive pages, ok? Also, feel free to suggest how to phrase this better. Case 87647." = "You need to turn on archive pages, ok? Also, feel free to suggest how to phrase this better. Case 87647.";

/* String_On_Page_Template */
"You really should add something to the collection so you can see it, ok? Also, feel free to suggest how to phrase this better. Case 87647." = "You really should add something to the collection so you can see it, ok? Also, feel free to suggest how to phrase this better. Case 87647.";

